sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
	tSensorData.ScaleAccel[0] = tSensorData.ScaleAccel[1] = tSensorData.ScaleAccel[2] = 1.0f;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_SPI2_Init();
  MX_I2C2_Init();
  

  /* USER CODE BEGIN 2 */
	LedOff();	 


	ctlSource = HMD_SOURCE;
	ctlSource += (GPIO_PIN_SET == HAL_GPIO_ReadPin(CTL_MODE1_GPIO_Port, CTL_MODE1_Pin)?1:0); 
	ctlSource += (GPIO_PIN_SET == HAL_GPIO_ReadPin(CTL_MODE2_GPIO_Port, CTL_MODE2_Pin)?2:0); 	
	srand(ctlSource);


	if (ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE)
	{
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET); 
		BlinkRease(30);
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_RESET);
		HAL_Delay(250);
	}

//	GPIO_InitTypeDef GPIO_InitStruct;
//	GPIO_InitStruct.Pin = I2C_SCL_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(I2C_SCL_GPIO_Port, &GPIO_InitStruct);
//	HAL_Delay(10);

//	for (int x=0; x<9;x++)
//	{
//		HAL_GPIO_WritePin(I2C_SCL_GPIO_Port, I2C_SCL_Pin, GPIO_PIN_RESET);
//		HAL_Delay(10);
//		HAL_GPIO_WritePin(I2C_SCL_GPIO_Port, I2C_SCL_Pin, GPIO_PIN_SET);
//		HAL_Delay(10);
//	}
//	
//	HAL_GPIO_DeInit(I2C_SCL_GPIO_Port, I2C_SCL_Pin);
//	HAL_Delay(10);
//	

	rfStatus = TrackedDevice_NRF24L01_Init();	
	if (rfStatus == 0x00 || rfStatus == 0xff)
		Error_Handler();
	LedOff();	
	

	sensorStatus = initSensors();		
	if (!sensorStatus)
		Error_Handler();
	LedOff();		
	
	//do some warmup
	for (int i=0; i<100; i++)
	{
		readAccelData(tSensorData.Accel);  // Read the x/y/z adc values			
		HAL_Delay(1);
		readGyroData(tSensorData.Gyro); 
		HAL_Delay(1);
		readMagData(tSensorData.Mag);
		HAL_Delay(10);
	}
	
	if (ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE)
	{
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET); 
		BlinkRease(20);
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_RESET);
		HAL_Delay(100);
	}

	
	//bool sensorWarmup = false;
	int extraDelay = ctlSource>HMD_SOURCE? 10:3;
	bool isCalibrated = false;
	bool hasRotationData = false;
	bool hasPositionData = false;
	uint8_t buttonRetransmit = 0;
	//bool hasTriggerData = false;

	CSensorFusion fuse(aRes, gRes, mRes);

	if (ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE)
	{
		//start background adc conversion
		if( HAL_ADC_Start(&hadc1) != HAL_OK)  
			Error_Handler();
		if (HAL_ADC_Start_DMA(&hadc1, (uint32_t*)ADC_Values, 3) != HAL_OK)  
			Error_Handler();
		HAL_Delay(100);
		
		//calculate analog averages
		for (int c=0; c<100; c++)
		{
			HAL_Delay(1);
			for (int i=0; i<3; i++)
				ADC_Averages[i] = (ADC_Averages[i] * 0.9f) + ((float)ADC_Values[i] * 0.1f);
		}
		for (int i=0; i<3; i++)
			ADC_Offsets[i] = ADC_Averages[i];		
	}
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	
	
	bool feedRawData = false;
	bool readyToSend = false;
	bool readyToReceive = false;
	
	Quaternion quat;
	//RF_ReceiveMode(&hspi2, NULL); //default to receive mode			
	uint32_t lastCommandSequence = 0;
	uint32_t vibrationStopTime = 0;	
	uint64_t lastButtonSend = 0;		
	uint64_t lastPositionTime = 0;
	uint64_t lastPositionSend;
	DigitalValues = DigitalCache = 0;
	
	int16_t AccelVector[3] = {0};
	int16_t GravityVector[3] = {0};
	float CompAccelVector[3] = {0};
	float VelocityVector[3] = {0};
	USBPositionData position = {0};
	
	while (true)
	{		
		Blink(blinkDelay);
		blinkDelay = 1000;
		
		now = HAL_GetMicros();				

		if (ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE)
		{
			for (int i=0; i<3; i++)
			{
				ADC_Averages[i] = (ADC_Averages[i] * 0.9f) + ((float)ADC_Values[i] * 0.1f);
				int32_t value = (int32_t)((ADC_Averages[i] - ADC_Offsets[i]) / 20.48f) ;			
				if (ADC_Cache[i] != value)
				{
					//if any analog value has changes
					ADC_Cache[i] = value;
					//hasTriggerData = true;
					buttonRetransmit = 5;					
				}
			}
			
			if (DigitalCache != DigitalValues)
			{
				//if any digital value has changes
				DigitalCache = DigitalValues;
				//hasTriggerData = true;
				buttonRetransmit = 5;
				lastButtonSend = now;
			}
			
			if (now - lastButtonSend > 500000)
			{
				//update button status every 500ms.
				buttonRetransmit++;
				lastButtonSend = now;
			}
		}
		

		
		float elapsedTime = (now - lastRotationUpdate) / 1000000.0f; // set integration time by time elapsed since last filter update				
		
		if (elapsedTime >= 0.005f) //update at 200hz
		{		
			hasRotationData |= readAccelData(tSensorData.Accel);  // Read the x/y/z adc values			
			hasRotationData |= readGyroData(tSensorData.Gyro); 
			hasRotationData |= readMagData(tSensorData.Mag);		
		}
				
		
		if (hasRotationData) //fuse it
		{
			tSensorData.TimeElapsed = elapsedTime;
			lastRotationUpdate = now;	
			Quaternion result = fuse.Fuse(&tSensorData);
			quat = CSensorFusion::Fix(fuse.m_RotQuat);			
			now = HAL_GetMicros();			
			if (isCalibrated && now >= 10000000)
			{
				float elapsedPositionTime = (now - lastPositionTime) / 1000000.0f;
				if (elapsedPositionTime >= 0.005) // calculate every 5 ms
				{
					result = (result * gravityQuat) * result.conjugate();
					GravityVector[0] = (int16_t)(result.x / (aRes * tSensorData.ScaleAccel[0])); //2.0f * (result.x * result.z - result.w * result.y); 
					GravityVector[1] = (int16_t)(result.y / (aRes * tSensorData.ScaleAccel[1])); //2.0f * (result.w * result.x + result.y * result.z); 
					GravityVector[2] = (int16_t)(result.z / (aRes * tSensorData.ScaleAccel[2])); //result.x * result.w - result.x * result.x - result.y * result.y + result.z * result.z; 				
					for (int i=0; i<3; i++)
					{
						AccelVector[i] = ((float)(tSensorData.Accel[i] + tSensorData.OffsetAccel[i])); // * aRes * tSensorData.ScaleAccel[i];					
						float prevVel = VelocityVector[i];
						float prevAcc = CompAccelVector[i];					
						CompAccelVector[i] = (float)(AccelVector[i] - GravityVector[i]) * 9.80665f * aRes * tSensorData.ScaleAccel[i]; 
						VelocityVector[i] += (prevAcc + ((CompAccelVector[i] - prevAcc) / 2.0f)) * elapsedPositionTime;
						position.Position[i] += (prevVel + ((VelocityVector[i] - prevVel) / 2.0f)) * elapsedPositionTime;				
						
