sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
					}	
					
					if (now - lastPositionSend >= 50000) //50 ms
					{
						hasPositionData = true;
						lastPositionSend = now;	
					}
					
					lastPositionTime = now;
				}
			}
			else
				lastPositionTime = now;
		}

		if (!readyToSend)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00; //send if not full
			readyToSend &= hasRotationData | feedRawData | hasPositionData | buttonRetransmit;
			//readyToSend = ((rfStatus & RF_TX_FIFO_EMPTY_Bit) == RF_TX_FIFO_EMPTY_Bit); //if empty 
		}
		
		if (readyToSend && HAL_GetTick() >= nextSend)
		{
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress); //switch to tx mode
			//HAL_MicroDelay(10);			
			blinkDelay = 100;

			sndCounter++;
			//send update
				
			if (feedRawData)
			{
				USBDataPacket.Header.Type = ctlSource | COMMAND_DATA;
				USBDataPacket.Header.Sequence++;
				USBDataPacket.Header.Crc8 = 0;
				USBDataPacket.Command.Command = CMD_RAW_DATA;
				for (int idx=0; idx<3; idx++)
				{
					USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel[idx];
					USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro[idx];
					USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag[idx];
				}
				SetPacketCrc(&USBDataPacket);
				RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
				do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete
				HAL_MicroDelay(10);
				//hasRotationData = hasPositionData = false;										
			}
			if (hasRotationData)
			{
				hasRotationData = false;
				//send rot data
				USBDataPacket.Header.Type = ctlSource | ROTATION_DATA;
				USBDataPacket.Header.Sequence++;
				USBDataPacket.Header.Crc8 = 0;
				USBDataPacket.Rotation.w = quat.w;
				USBDataPacket.Rotation.x = quat.x;
				USBDataPacket.Rotation.y = quat.y;
				USBDataPacket.Rotation.z = quat.z;	
				SetPacketCrc(&USBDataPacket);
				RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
				do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete	
				HAL_MicroDelay(10);
			} 
			if (hasPositionData)
			{
				hasPositionData = false;
				USBDataPacket.Header.Type = ctlSource | POSITION_DATA;
				USBDataPacket.Header.Sequence++;
				USBDataPacket.Header.Crc8 = 0;
				for (int i=0; i<3; i++)
					USBDataPacket.Position.Position[i] = position.Position[i];
				SetPacketCrc(&USBDataPacket);
				RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
				do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete
				HAL_MicroDelay(10);					
			} 
			if (buttonRetransmit)
			{
				buttonRetransmit--;
				//send trigger data
				USBDataPacket.Header.Type = ctlSource | TRIGGER_DATA;
				USBDataPacket.Header.Sequence++;
				USBDataPacket.Header.Crc8 = 0;
				USBDataPacket.Trigger.Analog[0].x = ((float)ADC_Cache[0]) / 200.0f;
				USBDataPacket.Trigger.Analog[0].y = 0;				
				USBDataPacket.Trigger.Analog[1].x = ((float)ADC_Cache[1]) / 100.0f;
				USBDataPacket.Trigger.Analog[1].y = ((float)ADC_Cache[2]) / 100.0f;
				USBDataPacket.Trigger.Digital = DigitalCache;
				SetPacketCrc(&USBDataPacket);
				RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
				do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete					
				HAL_MicroDelay(10);									
			}		
			
			if (!(hasRotationData | hasPositionData | buttonRetransmit))
				nextSend = HAL_GetTick() + (extraDelay + (rand() % 10));
			readyToSend = false;
			
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0); //back to rx mode
			//HAL_MicroDelay(10);
		}
		
		if (!readyToReceive)
		{
			rfStatus = RF_Status(&hspi2);
			readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR;
		}

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00;
			while (readyToReceive)
			{			
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)pUSBCommandPacket, sizeof(USBPacket)) == 0; //if not empty 
				
				if (CheckPacketCrc(pUSBCommandPacket) && ((pUSBCommandPacket->Header.Type & 0x0F)) == ctlSource)
				{
					if (lastCommandSequence != pUSBCommandPacket->Header.Sequence) //discard duplicates
					{
						lastCommandSequence = pUSBCommandPacket->Header.Sequence; 
						switch (pUSBCommandPacket->Command.Command)
						{
							case CMD_RAW_DATA:								
								feedRawData = pUSBCommandPacket->Command.Data.Raw.State != 0;
								break;
							case CMD_VIBRATE:
								vibrationStopTime = HAL_GetTick() + pUSBCommandPacket->Command.Data.Vibration.Duration;
								HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET);							
								break;
							case CMD_CALIBRATE:
								//manually set sensor offsets
								for (int i=0; i<3; i++)
								{
									position.Position[i] = 0;
									VelocityVector[i] = 0;
									if ((pUSBCommandPacket->Command.Data.Calibration.SensorMask & SENSOR_ACCEL) == SENSOR_ACCEL)
									{
										tSensorData.OffsetAccel[i] =  pUSBCommandPacket->Command.Data.Calibration.OffsetAccel[i];
										tSensorData.ScaleAccel[i] =  FROM_CALIB_SCALE(pUSBCommandPacket->Command.Data.Calibration.ScaleAccel[i]);
										if (tSensorData.ScaleAccel[i] < 0.0001f || tSensorData.ScaleAccel[i] > 2.0f) tSensorData.ScaleAccel[i] = 1.0f;
									}
									if ((pUSBCommandPacket->Command.Data.Calibration.SensorMask & SENSOR_GYRO) == SENSOR_GYRO)
										tSensorData.OffsetGyro[i] = pUSBCommandPacket->Command.Data.Calibration.OffsetGyro[i];
									if ((pUSBCommandPacket->Command.Data.Calibration.SensorMask & SENSOR_MAG) == SENSOR_MAG)
										tSensorData.OffsetMag[i] = pUSBCommandPacket->Command.Data.Calibration.OffsetMag[i];
								}
								isCalibrated = true;
								lastPositionSend = lastPositionTime = now;
								break;
						}
					}
					pUSBCommandPacket->Header.Type = 0xff;				
				}									
			}
		}
		
